export const socialIconUrl = [
  {
    Url: "/icons8-youtube.svg",
    Link: "https://www.youtube.com/@rezaandhamze",
  },

  { Url: "/icons8-facebook.svg", Link: "" },
  { Url: "/icons8-whatsapp.svg", Link: "https://wa.me/message/RICVZ44PFD4FO1" },
  { Url: "/public/icons8-telegram.svg", Link: "https://t.me/reza_17s" },
  {
    Url: "/icons8-instagram.svg",
    Link: "https://www.instagram.com/reza.s.16?utm_source=qr&igsh=aW5pZWx4bng2a3pj",
  },
];
export const pageLinks = [
  { Url: "Home", iconUrl: "/icons8-home.svg" },
  { Url: "Service", iconUrl: "/icons8-services (1).svg" },
  { Url: "Project", iconUrl: "/icons8-test-account-96.png" },
  { Url: "Contact", iconUrl: "/icons8-connect.svg" },
  { Url: "About", iconUrl: "/icons8-about.svg" },
];
export const servicesDescription = [
  {
    id: 1,
    title: "سایت وردپرس",
    title2: "سایت وردپرسی چیست؟ ",
    title3: " مزایای سایت وردپرسی نسبت به سایت اختصاصی",
    title4: " معایب سایت وردپرسی نسبت به سایت اختصاصی",
    Description:
      "ایجاد سایت وردپرسی با طراحی های خلاقانه و به روز با سطوح UI وUX بالا، سئوی بالا، سرعت بارگذاری بالا و خدمات دامنه و هاست",
    Description2:
      "وردپرس یک سیستم مدیریت محتوای آماده برای طراحی سایت است. WordPress به‌صورت رایگان و متن باز (Open Source) است که با زبان برنامه نویسی PHP توسعه داده شده است. توسط وردپرس می‌توان انواع سایت‌های شخصی، شرکتی، خدماتی، پزشکی، فروشگاهی و... را طراحی کرد.",

    Advantages: [
      "سایت وردپرسی نسبت به سایت اختصاصی به زمان کمتری برای طراحی نیاز دارد.",
      "قیمت سایت‌های وردپرسی نسبت به سایت‌های اختصاصی ارزان‌تر است.",
      "برای سایت‌های وردپرسی، قالب‌های زیاد و متنوعی وجود دارد که ممکن است نیاز کاربر را تا حد زیادی رفع کند.",
      "برای طراحی سایت وردپرسی نیازی به دانش برنامه نویسی نیست.",
      "وجود افزونه‌های Yoast SEO و Rank Math SEO می‌تواند به سئوی محتوا کمک کند",
    ],
    Disadvantages: [
      "سرعت سایت‌های وردپرسی معمولا کمتر از سایت‌های اختصاصی است، چون در وردپرس امکانات زیادی قرار گرفته است تا مناسب همه‌ی کسب‌وکارها باشد. ممکن است اکثر این امکانات مورد استفاده قرار نگیرد و سایت را سنگین کند.",
      "در وردپرس ممکن است بین افزونه‌ها و قالب سایت تداخل ایجاد شود و سایت به مشکل بخورد.",
      "وردپرس برای پروژه‌هایی با مقیاس بزرگ، مناسب و بهینه نیست.",
      "ممکن است وردپرس پاسخگوی همه‌ی نیازهای یک کارفرما نباشد.",
    ],
  },
  {
    id: 3,
    title: "سایت اختصاصی",
    title2: "سایت اختصاصی چیست؟ ",
    title3: "مزایای سایت اختصاصی نسبت به سایت وردپرسی",
    title4: "معایب سایت اختصاصی نسبت به سایت وردپرسی",
    Description:
      "ساخت سایت اختصاصی با React.js یا فریم ورک Next.js برای فرانت اند و از Node.js برای بک اند و ساخت Api ",
    Description2:
      " سایت اختصاصی یا سیستم مدیریت محتوای اختصاصی، توسط یک زبان برنامه نویسی با توجه به نیاز کارفرما، کدنویسی می‌شود. سایت‌های اختصاصی از صفر تا صد نوشته می‌شوند و مانند وردپرس آماده و رایگان نیستند. به دلیل اینکه سیستم مدیریت محتوای اختصاصی نیاز به زمان و انرژی بیشتری دارد، قیمت آن گران‌تر از طراحی سایت با وردپرس است \n\n طراحی سایت با وردپرس به دست یک نفر ممکن است انجام شود اما برنامه نویسی اختصاصی کار یک نفر نیست و معمولا تیم‌های چند نفره باید آن را توسعه دهند. برنامه نویسی اختصاصی شامل تیم UI/UX،فرانت‌اند، بک‌اند، دواپس مدیر محصول و سایر کسانی هستند که در توسعه سایت اختصاصی نقش دارند.",
    Advantages: [
      "مکان شخصی سازی با توجه به نیاز کارفرما.",
      "سایت اختصاصی برخلاف وردپرس، پاسخگوی همه‌ی نیازهای مشتری است.",
      "سایت‌های اختصاصی قالب‌های زیباتری نسبت به وردپرس دارند چون منحصر به فرد آن سایت طراحی می‌شوند و مانند وردپرس تکراری نیستند.",
      "سئو تکنیکال در سایت اختصاصی بهتر است چون از کدهای اضافی که در قالب‌های وردپرسی وجود دارد جلوگیری می‌شود و کاملا بهینه هستند.",
      "سرعت سایت‌های اختصاصی نسبت به سایت‌های وردپرسی فوق‌العاده بالا است چون مناسب نیاز آن طراحی شده و کدهای زاید و اضافی در آن وجود ندارد.",
      "سایت اختصاصی برای پروژه‌هایی با مقیاس بزرگ کاملا جوابگو است.",
    ],
    Disadvantages: [
      "سایت اختصاصی نسبت به سایت وردپرسی هزینه بالایی دارد.",
      "سایت اختصاصی در مقایسه با سایت وردپرسی، زمان بیشتری برای برنامه نویسی نیاز دارد.",
    ],
  },
];
export const Projects = [
  {
    id: 1,
    link: "https://snapgram-me.netlify.app",
    title: "Snapgram",
    img: "/public/2024-02-20 20_31_51-.png",
    desc: "عنوان:Snapgram - پلتفرم اجتماعی بی‌نظیر شما\n\nبه Snapgram خوش آمدید، یک پلتفرم اجتماعی پویا که طراحی شده است تا تجربه اجتماعی شما را تغییر دهد. با یک رابط کاربری دوستانه و دسته‌ای از ویژگی‌ها، این پلتفرم به نیازهای متنوع شما پاسخ می‌دهد و بهترین مقصد برای ارتباط اجتماعی شما می‌شود.\n\nویژگی‌های کلیدی:\n1. ویژگی ورود: به سادگی یک حساب کاربری در Snapgram ایجاد کنید و به دنیایی از تعاملات شخصی دسترسی پیدا کنید.\n2. ویژگی افزودن پست: افکان به اشتراک گذاری افکانها، بروزرسانی‌ها و لحظات به سادگی با سیستم ساخت پست ما.\n3. قابلیت ذخیره پست‌ها: هیچگاه مسیر محتوای مهم یا محبوب خود را از دست ندهید. پست‌ها را برای دسترسی آسان هر زمانی که می‌خواهید ذخیره کنید.\n4. حالت تاریک: تجربه بصری خود را با حالت تاریک شیک و راحتی افزایش دهید که برای محیط‌های نور کم بسیار مناسب است.\n",
  },
  {
    id: 2,
    link: "https://thewildovasis.netlify.app",
    title: "The wild oasis",
    img: "/public/2024-02-20 20_30_51-.png",
    desc: "عنوان: کاوش در وایلد اوسیس - راهکار مدیریت هتل شما خوش آمدید به وایلد اوسیس، برنامه مدیریت هتل شما. داشبورد با ویژگی‌های زمان واقعی فروش و نرخ اشغال. صفحه رزرو با جزئیات کابین‌ها و امکان ویرایش. مدیریت کاربران و تنظیمات، ویژگی ورود برای دسترسی امن و حالت تاریک برای تجربه بهتر در نور کم. با وایلد اوسیس، مدیریت هتل خود را بهبود بخشید و رضایت مهمانان را ارتقا دهید.",
  },
  {
    id: 3,
    title: "WorldWise",
    link: "https://comforting-elf-adf9e0.netlify.app",
    img: "/public/Screenshot 2024-02-07 195551.png  ",
    desc: "عنوان: جهانگردی با ورلدواید - همراه سفر شما به دنیای سفر\nبا ورلدواید، پلتفرم کامل برای تجربه‌ی سفر بدون مرز، به سفر جادویی خود شروع کنید. این راه‌حل جامع سفر دارای یک رابط کاربری دوستانه است که شامل یک صفحه قیمت‌گذاری، یک صفحه محصول و یک ویژگی ورود ایمن می‌شود.\n\nویژگی‌های کلیدی:\n1. صفحه قیمت‌گذاری: گزینه‌های شفاف و رقابتی قیمت را بررسی کنید که به نیازهای سفر شما تنظیم شده‌اند و تجربه برنامه‌ریزی بدون مشکل را ایجاد می‌کنند.\n2. صفحه محصول: در یک مکان، گزینه‌های گسترده‌ای از مقاصد، اقامتگاه‌ها و فعالیت‌های هیجان‌انگیز را کشف کنید.\n3. ویژگی ورود: از طریق ویژگی ورود راحت و ایمن، به خدمات سفر شخصی‌سازی شده دسترسی پیدا کنید، رزروهای خود را مدیریت کنید و از پیشنهادات اختصاصی بهره‌مند شوید.\nبا ورلدواید، سفر به ماجرا تبدیل می‌شود. به ما بپیوندید و هر سفری را به یک خاطره فراموش‌ناپذیر تبدیل کنید!",
  },
  // {
  //   id: 4,
  //   title: "Music App",
  //   img: "/still-b37a298b212f8981130ecf646b27863a.png",
  //   desc: "Lorem ipsum dolor sit amet consectetur adipisicing elit. Dolores ab id ad nesciunt quo aut corporis modi? Voluptate, quos sunt dolorum facilis, id eum sequi placeat accusantium saepe eos laborum.",
  // },
];
